# St7SetGeometryFaceProperty

Assigns a property number to the specified geometry face.

long St7SetGeometryFaceProperty(long uID, long FaceNum, long PropNum)

Input Parameters

uID

Strand7 model file ID.

FaceNum

Face number.

PropNum

Property number.